// export const mapInfo = [
//   {
//     id:0,
//     value: {
//       程家沟矿: [112.31271, 37.08638] ,
//       石湖矿: [110.035755, 40.360695] ,
//       焦家寨矿: [111.402964, 38.873135] ,
//       轩岗煤电公司: [112.43023, 38.89896],
//     }
//   },
//   {
//     id: 1,
//     value: {
//       程家沟矿: [112.31271, 37.08638] ,
//       石湖矿: [110.035755, 40.360695] ,
//       焦家寨矿: [111.402964, 38.873135] ,
//       轩岗煤电公司: [112.43023, 38.89896],
//     }
//   }
// ]

  

export const geoCoordMap = {
  程家沟矿: [112.31271, 37.08638],
  石湖矿: [110.035755, 40.360695],
  焦家寨矿: [111.402964, 38.873135],
  轩岗煤电公司: [112.43023, 38.89896],
  同煤集团: [113.20312578, 40.04471515],
  马道头煤业: [12.649887, 39.83884 ],
  隆博煤业: [110.800339, 35.861408],
  虎峰煤业: [111.6244794, 	35.7498171],
  同盈矿: [112.560233, 	39.022629],
  同忻矿: [113.1016839, 39.9749167],
  宏大公司:	[111.5416293, 36.1336759],
  胜利煤业:[110.7477377, 36.26365072],
  朔州煤电公司: [112.92835, 39.77024],
  增子坊矿: [112.60551, 39.80639],
  云冈矿:[113.1209207, 40.11849296],
  燕子山矿: [112.935806, 40.086697],
  王坪矿: [112.924683, 39.774158],
  安平矿: [112.7495, 39.728],
  雪坪煤业: [111.3350567, 36.4537702],
  姜家湾矿: [113.0786866, 40.12147401],
  四台矿: [113.014791, 40.10651336],	
  马脊梁矿: [112.9025, 39.973888],
  同安煤业: [111.7699242, 38.17249804],
  圣厚源煤业: [112.4937344, 39.48880724],
  挖金湾矿: [112.823332, 39.923332],
  永定庄煤业: [113.10931, 40.01451],
  峪沟矿: [112.4420948, 39.11881985],
  梵王寺矿: [112.3555684, 39.17503743],
  白洞矿: [113.01, 39.59],
  洪崖煤业: [111.8787852, 36.33725544],
  塔山矿: [113.0723459, 39.92089058],
  同发东周窑煤业: [112.8739214, 40.01113227],
  南阳坡矿: [112.6126051, 39.77567791],
  色连矿: [109.8770517, 39.8979751],
  小峪矿: [112.908923, 39.814199],
  豁口煤业: [111.359278, 36.275872],
  锦程煤业: [111.8669568, 36.10072],
  树儿里矿: [112.6549024, 39.81156222],
  青磁窑矿: [113.157129, 40.11796745],
  忻州窑矿: [113.139845, 40.042634],
  王村煤业: [112.93585, 39.93762],
  千井矿: [112.57111, 39.69946],	
  地煤公司: [113.22144, 39.99597],
  益晟矿: [112.8355779, 39.95188572],
  同地永财坡矿: [112.8269941, 40.03579321],
  万杰煤业: [110.856349, 35.732807],
  兴旺矿: [113.1546228, 40.07629736],
  煤峪口矿: [113.042777, 40.022777],
  焦煤矿:[112.018426, 39.847958]
}

export const getGeoCoordList = (val = 0) => {
  console.log(val, 222)
  
  const res = []
  for (const key in geoCoordMap) {
    res.push({ name: key, value: geoCoordMap[key] })
  }
  return res

  // const fit = mapInfo.filter((item) => {
  //   return item.id = val
  // })
  // console.log(fit)
  // const fat =fit[0].value
  // const res = []
  // for (const key in fat) {
  //   res.push({ name: key, value: fat[key] })
  // }
  // return res


}


export const lines = [
  //轩岗煤电公司
  
  [geoCoordMap['程家沟矿'], geoCoordMap['轩岗煤电公司']],
  [geoCoordMap['石湖矿'], geoCoordMap['轩岗煤电公司']],
  [geoCoordMap['焦家寨矿'], geoCoordMap['轩岗煤电公司']],
  //地煤公司
  [geoCoordMap['焦煤矿'], geoCoordMap['地煤公司']],
  [geoCoordMap['安平矿'], geoCoordMap['地煤公司']],
  [geoCoordMap['树儿里矿'], geoCoordMap['地煤公司']],
  [geoCoordMap['益晟矿'], geoCoordMap['地煤公司']],
  [geoCoordMap['同地永财坡矿'], geoCoordMap['地煤公司']],
  [geoCoordMap['青磁窑矿'], geoCoordMap['地煤公司']],
  [geoCoordMap['姜家湾矿'], geoCoordMap['地煤公司']],
  [geoCoordMap['兴旺矿'], geoCoordMap['地煤公司']],
  [geoCoordMap['峪沟矿'], geoCoordMap['地煤公司']],
  //朔州煤电公司
  [geoCoordMap['王坪矿'], geoCoordMap['朔州煤电公司']],
  [geoCoordMap['小峪矿'], geoCoordMap['朔州煤电公司']],
  [geoCoordMap['增子坊矿'], geoCoordMap['朔州煤电公司']],
  [geoCoordMap['南阳坡矿'], geoCoordMap['朔州煤电公司']],
  [geoCoordMap['千井矿'], geoCoordMap['朔州煤电公司']],
  [geoCoordMap['同盈矿'], geoCoordMap['朔州煤电公司']],
  //宏大公司
  [geoCoordMap['隆博煤业'], geoCoordMap['宏大公司']],
  [geoCoordMap['万杰煤业'], geoCoordMap['宏大公司']],
  [geoCoordMap['虎峰煤业'], geoCoordMap['宏大公司']],
  [geoCoordMap['洪崖煤业'], geoCoordMap['宏大公司']],
  [geoCoordMap['锦程煤业'], geoCoordMap['宏大公司']],
  [geoCoordMap['豁口煤业'], geoCoordMap['宏大公司']],
  [geoCoordMap['雪坪煤业'], geoCoordMap['宏大公司']],
  [geoCoordMap['胜利煤业'], geoCoordMap['宏大公司']],
//本部矿井
  [geoCoordMap['地煤公司'], geoCoordMap['同煤集团']],
  [geoCoordMap['朔州煤电公司'], geoCoordMap['同煤集团']],
  [geoCoordMap['轩岗煤电公司'], geoCoordMap['同煤集团']],
  [geoCoordMap['宏大公司'], geoCoordMap['同煤集团']],
]
