export const geoCoordMap = {
  程家沟矿: [112.31271, 37.08638],
  石湖矿: [110.035755, 40.360695],
  焦家寨矿: [111.402964, 38.873135],
  轩岗煤电公司: [112.43023, 38.89896],
  同煤集团: [113.20312578, 40.04471515],
  马道头煤业: [12.649887, 39.83884],
  隆博煤业: [110.800339, 35.861408],
  虎峰煤业: [111.6244794, 35.7498171],
  同盈矿: [112.560233, 39.022629],
  同忻矿: [113.1016839, 39.9749167],
  宏大公司: [111.5416293, 36.1336759],
  胜利煤业: [110.7477377, 36.26365072],
  朔州煤电公司: [112.92835, 39.77024],
  增子坊矿: [112.60551, 39.80639],
  云冈矿: [113.1209207, 40.11849296],
  燕子山矿: [112.935806, 40.086697],
  王坪矿: [112.924683, 39.774158],
  安平矿: [112.7495, 39.728],
  雪坪煤业: [111.3350567, 36.4537702],
  姜家湾矿: [113.0786866, 40.12147401],
  四台矿: [113.014791, 40.10651336],
  马脊梁矿: [112.9025, 39.973888],
  同安煤业: [111.7699242, 38.17249804],
  圣厚源煤业: [112.4937344, 39.48880724],
  挖金湾矿: [112.823332, 39.923332],
  永定庄煤业: [113.10931, 40.01451],
  峪沟矿: [112.4420948, 39.11881985],
  梵王寺矿: [112.3555684, 39.17503743],
  白洞矿: [113.01, 39.59],
  洪崖煤业: [111.8787852, 36.33725544],
  塔山矿: [113.0723459, 39.92089058],
  同发东周窑煤业: [112.8739214, 40.01113227],
  南阳坡矿: [112.6126051, 39.77567791],
  色连矿: [109.8770517, 39.8979751],
  小峪矿: [112.908923, 39.814199],
  豁口煤业: [111.359278, 36.275872],
  锦程煤业: [111.8669568, 36.10072],
  树儿里矿: [112.6549024, 39.81156222],
  青磁窑矿: [113.157129, 40.11796745],
  忻州窑矿: [113.139845, 40.042634],
  王村煤业: [112.93585, 39.93762],
  千井矿: [112.57111, 39.69946],
  地煤公司: [113.22144, 39.99597],
  益晟矿: [112.8355779, 39.95188572],
  同地永财坡矿: [112.8269941, 40.03579321],
  万杰煤业: [110.856349, 35.732807],
  兴旺矿: [113.1546228, 40.07629736],
  煤峪口矿: [113.042777, 40.022777],
  焦煤矿: [112.018426, 39.847958]
}

const map = {
  0: {
    name: '同煤集团',
    shortName: '本部',
    color: 'rgba(139, 28, 98, .8)',
    zoom: 3,
    include: [
      '轩岗煤电公司',
      '朔州煤电公司',
      '地煤公司',
      '轩岗煤电公司'
    ]
  },
  1: {
    name: '地煤公司',
    shortName: '地煤',
    color: 'rgba(255, 235, 59, .7)',
    zoom: 4,
    include: ['焦煤矿',
      '安平矿',
      '树儿里矿',
      '益晟矿',
      '同地永财坡矿',
      '青磁窑矿',
      '姜家湾矿',
      '兴旺矿',
      '峪沟矿']
  },
  2: {
    name: '朔州煤电公司',
    shortName: '朔煤',
    zoom: 4,
    color: 'rgba(139, 136, 120, .8)',
    include: [
      '王坪矿',
      '小峪矿',
      '增子坊矿',
      '南阳坡矿',
      '千井矿',
      '同盈矿'
    ]
  },
  3: {
    name: '轩岗煤电公司',
    shortName: '轩煤',
    zoom: 4,
    color: 'rgba(241, 109, 115, .8)',
    include: ['隆博煤业',
      '万杰煤业',
      '虎峰煤业',
      '洪崖煤业',
      '锦程煤业',
      '豁口煤业',
      '雪坪煤业',
      '胜利煤业']
  },
  4: {
    name: '宏大公司',
    shortName: '宏大',
    zoom: 5,
    color: 'rgba(147, 235, 248, .8)',
    include: [
      '万杰煤业',
      '虎峰煤业',
      '洪崖煤业',
      '锦程煤业',
      '豁口煤业',
      '雪坪煤业',
      '胜利煤业'
    ]
  }
}
export const getMap = (id) => {
  return typeof id === 'number' && map[id] !== undefined ? map[id] : false
}

export const getGeoCoordList = (id) => {
  const _map = getMap(id)
  let res = {}
  //初始化线全部数据
  if (_map === false) {
    for (const key in map) {
      const { include, name, color } = map[key]
      res[name] = {
        data: include.map(name => {
          return { name, value: geoCoordMap[name] }
        }),
        color
      }
    }
  } else { //公司线数据
    const { include, name, color } = _map
    res[name] = {
      data: include.map(name => {
        return { name, value: geoCoordMap[name] }
      }),
      color
    }
    res[name].data.push({ name, value: geoCoordMap[name] })
  }
  return res
}

export const getLines = id => {
  const _map = getMap(id)
  let res = []
  //初始化时全部坐标数据
  if (_map === false) {
    for (const key in map) {
      const { include, name } = map[key]
      const parent = geoCoordMap[name]   //公司坐标
      res.push(...include.map(_name => [geoCoordMap[_name], parent]))
    }
  } else {//公司坐标数据
    const { include, name } = _map
    const parent = geoCoordMap[name]
    res = include.map(_name => [geoCoordMap[_name], parent])
  }
  return res
}
